zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXA276VLQ-pinctrl.h
#define FLEXIO0_D10_P2_2 A15X_MUX('2',2,6) /* PT2_2 */
#define SmartDMA_PIO26_P2_2 A15X_MUX('2',2,7) /* PT2_2 */
#define ADC0_A3_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define CMP1_IN0_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define WUU0_IN19_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define ADC1_A4_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define TRIG_IN7_P2_3 A15X_MUX('2',3,1) /* PT2_3 */
#define LPUART0_CTS_B_P2_3 A15X_MUX('2',3,2) /* PT2_3 */
#define LPUART2_RXD_P2_3 A15X_MUX('2',3,3) /* PT2_3 */
#define TRIG_IN7/CT_INP13_P2_3_P2_3 A15X_MUX('2',3,4) /* PT2_3 */
#define CT_INP13_P2_3 A15X_MUX('2',3,4) /* PT2_3 */
#define CT2_MAT3_P2_3 A15X_MUX('2',3,5) /* PT2_3 */
#define FLEXIO0_D11_P2_3 A15X_MUX('2',3,6) /* PT2_3 */
#define SmartDMA_PIO27_P2_3 A15X_MUX('2',3,7) /* PT2_3 */
#define P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define CMP2_IN0_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define ADC2_A0_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define ADC0_A1_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define LPUART2_CTS_B_P2_4 A15X_MUX('2',4,3) /* PT2_4 */
#define CT_INP14_P2_4 A15X_MUX('2',4,4) /* PT2_4 */
#define CT1_MAT0_P2_4 A15X_MUX('2',4,5) /* PT2_4 */
#define FLEXIO0_D12_P2_4 A15X_MUX('2',4,6) /* PT2_4 */
#define SmartDMA_PIO28_P2_4 A15X_MUX('2',4,7) /* PT2_4 */
#define ADC3_A0_P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define ADC1_A1_P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define LPUART2_RTS_B_P2_5 A15X_MUX('2',5,3) /* PT2_5 */
#define CT_INP15_P2_5 A15X_MUX('2',5,4) /* PT2_5 */
#define CT1_MAT1_P2_5 A15X_MUX('2',5,5) /* PT2_5 */
#define FLEXIO0_D13_P2_5 A15X_MUX('2',5,6) /* PT2_5 */
#define SmartDMA_PIO29_P2_5 A15X_MUX('2',5,7) /* PT2_5 */
#define OPAMP2_OUT_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define ADC2_A2_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define ADC1_A3_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define TRIG_OUT4_P2_6 A15X_MUX('2',6,1) /* PT2_6 */
#define LPSPI1_PCS1_P2_6 A15X_MUX('2',6,2) /* PT2_6 */
#define LPUART4_RXD_P2_6 A15X_MUX('2',6,3) /* PT2_6 */
#define CT_INP18_P2_6 A15X_MUX('2',6,4) /* PT2_6 */
#define CT1_MAT2_P2_6 A15X_MUX('2',6,5) /* PT2_6 */
#define FLEXIO0_D14_P2_6 A15X_MUX('2',6,6) /* PT2_6 */
#define SmartDMA_PIO30_P2_6 A15X_MUX('2',6,7) /* PT2_6 */
#define ADC0_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define VREFI_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC2_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC1_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC3_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define TRIG_IN5_P2_7 A15X_MUX('2',7,1) /* PT2_7 */
#define LPUART4_TXD_P2_7 A15X_MUX('2',7,3) /* PT2_7 */
#define CT_INP19_P2_7 A15X_MUX('2',7,4) /* PT2_7 */
#define TRIG_IN5/CT_INP19_P2_7_P2_7 A15X_MUX('2',7,4) /* PT2_7 */
#define CT1_MAT3_P2_7 A15X_MUX('2',7,5) /* PT2_7 */
#define FLEXIO0_D15_P2_7 A15X_MUX('2',7,6) /* PT2_7 */
#define SmartDMA_PIO31_P2_7 A15X_MUX('2',7,7) /* PT2_7 */
#define P2_8 A15X_MUX('2',8,0) /* PT2_8 */
#define TRIG_OUT3_P2_8 A15X_MUX('2',8,1) /* PT2_8 */
#define CT3_MAT0_P2_8 A15X_MUX('2',8,4) /* PT2_8 */
#define FLEXIO0_D16_P2_8 A15X_MUX('2',8,6) /* PT2_8 */
#define P2_9 A15X_MUX('2',9,0) /* PT2_9 */
#define TRIG_IN4_P2_9 A15X_MUX('2',9,1) /* PT2_9 */
#define CT3_MAT1_P2_9 A15X_MUX('2',9,4) /* PT2_9 */
#define FLEXIO0_D17_P2_9 A15X_MUX('2',9,6) /* PT2_9 */
#define P2_10 A15X_MUX('2',10,0) /* PT2_10 */
#define ADC2_A1_P2_10 A15X_MUX('2',10,0) /* PT2_10 */
#define TRIG_OUT5_P2_10 A15X_MUX('2',10,1) /* PT2_10 */
#define LPUART2_TXD_P2_10 A15X_MUX('2',10,3) /* PT2_10 */
#define CT3_MAT2_P2_10 A15X_MUX('2',10,4) /* PT2_10 */
#define FLEXIO0_D18_P2_10 A15X_MUX('2',10,6) /* PT2_10 */
#define SmartDMA_PIO14_P2_10 A15X_MUX('2',10,7) /* PT2_10 */
#define ADC3_A1_P2_11 A15X_MUX('2',11,0) /* PT2_11 */
#define P2_11 A15X_MUX('2',11,0) /* PT2_11 */
#define TRIG_IN4_P2_11 A15X_MUX('2',11,1) /* PT2_11 */
#define LPUART2_RXD_P2_11 A15X_MUX('2',11,3) /* PT2_11 */
#define CT3_MAT3_P2_11 A15X_MUX('2',11,4) /* PT2_11 */
#define FLEXIO0_D19_P2_11 A15X_MUX('2',11,6) /* PT2_11 */
#define SmartDMA_PIO15_P2_11 A15X_MUX('2',11,7) /* PT2_11 */
#define P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define ADC2_A5_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define WUU0_IN20_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define OPAMP0_INP_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define ADC0_A5_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define USB0_VBUS_DET_P2_12 A15X_MUX('2',12,1) /* PT2_12 */
#define LPSPI1_SCK_P2_12 A15X_MUX('2',12,2) /* PT2_12 */
#define LPUART1_RXD_P2_12 A15X_MUX('2',12,3) /* PT2_12 */
#define CT4_MAT0_P2_12 A15X_MUX('2',12,4) /* PT2_12 */
#define CT0_MAT0_P2_12 A15X_MUX('2',12,5) /* PT2_12 */
#define FLEXIO0_D20_P2_12 A15X_MUX('2',12,6) /* PT2_12 */
#define SmartDMA_PIO16_P2_12 A15X_MUX('2',12,7) /* PT2_12 */
#define CAN0_RXD_P2_12 A15X_MUX('2',12,11) /* PT2_12 */
#define P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define OPAMP0_INN_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define ADC1_A5_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define ADC3_A5_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define TRIG_IN8_P2_13 A15X_MUX('2',13,1) /* PT2_13 */
#define LPSPI1_SDO_P2_13 A15X_MUX('2',13,2) /* PT2_13 */
#define LPUART1_TXD_P2_13 A15X_MUX('2',13,3) /* PT2_13 */
#define CT4_MAT1_P2_13 A15X_MUX('2',13,4) /* PT2_13 */
#define CT0_MAT1_P2_13 A15X_MUX('2',13,5) /* PT2_13 */
#define FLEXIO0_D21_P2_13 A15X_MUX('2',13,6) /* PT2_13 */
#define SmartDMA_PIO17_P2_13 A15X_MUX('2',13,7) /* PT2_13 */
#define CAN0_TXD_P2_13 A15X_MUX('2',13,11) /* PT2_13 */
#define P2_14 A15X_MUX('2',14,0) /* PT2_14 */
#define CT4_MAT2_P2_14 A15X_MUX('2',14,4) /* PT2_14 */
#define FLEXIO0_D22_P2_14 A15X_MUX('2',14,6) /* PT2_14 */
#define OPAMP0_OUT_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define ADC0_A2_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define WUU0_IN21_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define TRIG_OUT4_P2_15 A15X_MUX('2',15,1) /* PT2_15 */
#define LPSPI1_SDI_P2_15 A15X_MUX('2',15,2) /* PT2_15 */
#define LPUART1_RTS_B_P2_15 A15X_MUX('2',15,3) /* PT2_15 */
#define CT4_MAT3_P2_15 A15X_MUX('2',15,4) /* PT2_15 */
#define CT0_MAT2_P2_15 A15X_MUX('2',15,5) /* PT2_15 */
#define FLEXIO0_D23_P2_15 A15X_MUX('2',15,6) /* PT2_15 */
#define SmartDMA_PIO18_P2_15 A15X_MUX('2',15,7) /* PT2_15 */
#define CAN1_RXD_P2_15 A15X_MUX('2',15,11) /* PT2_15 */
#define ADC2_A4_P2_16 A15X_MUX('2',16,0) /* PT2_16 */
#define ADC0_A6_P2_16 A15X_MUX('2',16,0) /* PT2_16 */
#define P2_16 A15X_MUX('2',16,0) /* PT2_16 */
#define OPAMP1_INP_P2_16 A15X_MUX('2',16,0) /* PT2_16 */
#define LPSPI1_SDI_P2_16 A15X_MUX('2',16,2) /* PT2_16 */
#define LPUART1_RTS_B_P2_16 A15X_MUX('2',16,3) /* PT2_16 */
#define CT3_MAT0_P2_16 A15X_MUX('2',16,4) /* PT2_16 */
#define CT0_MAT2_P2_16 A15X_MUX('2',16,5) /* PT2_16 */
#define FLEXIO0_D24_P2_16 A15X_MUX('2',16,6) /* PT2_16 */
#define SmartDMA_PIO19_P2_16 A15X_MUX('2',16,7) /* PT2_16 */
#define CAN1_TXD_P2_16 A15X_MUX('2',16,11) /* PT2_16 */
#define ADC1_A6_P2_17 A15X_MUX('2',17,0) /* PT2_17 */
#define OPAMP1_INN_P2_17 A15X_MUX('2',17,0) /* PT2_17 */
#define ADC3_A4_P2_17 A15X_MUX('2',17,0) /* PT2_17 */
#define P2_17 A15X_MUX('2',17,0) /* PT2_17 */
#define TRIG_IN9_P2_17 A15X_MUX('2',17,1) /* PT2_17 */
#define LPSPI1_PCS0_P2_17 A15X_MUX('2',17,2) /* PT2_17 */
#define LPUART1_CTS_B_P2_17 A15X_MUX('2',17,3) /* PT2_17 */
#define CT3_MAT1_P2_17 A15X_MUX('2',17,4) /* PT2_17 */
#define CT0_MAT3_P2_17 A15X_MUX('2',17,5) /* PT2_17 */
#define FLEXIO0_D25_P2_17 A15X_MUX('2',17,6) /* PT2_17 */
#define SmartDMA_PIO20_P2_17 A15X_MUX('2',17,7) /* PT2_17 */
#define P2_18 A15X_MUX('2',18,0) /* PT2_18 */
#define CT3_MAT2_P2_18 A15X_MUX('2',18,4) /* PT2_18 */
#define FLEXIO0_D26_P2_18 A15X_MUX('2',18,6) /* PT2_18 */
#define P2_19 A15X_MUX('2',19,0) /* PT2_19 */
#define ADC1_A2_P2_19 A15X_MUX('2',19,0) /* PT2_19 */
#define OPAMP1_OUT_P2_19 A15X_MUX('2',19,0) /* PT2_19 */
#define TRIG_OUT5_P2_19 A15X_MUX('2',19,1) /* PT2_19 */
#define CT3_MAT3_P2_19 A15X_MUX('2',19,4) /* PT2_19 */
#define FLEXIO0_D27_P2_19 A15X_MUX('2',19,6) /* PT2_19 */
#define SmartDMA_PIO21_P2_19 A15X_MUX('2',19,7) /* PT2_19 */
#define OPAMP3_INP_P2_20 A15X_MUX('2',20,0) /* PT2_20 */
#define P2_20 A15X_MUX('2',20,0) /* PT2_20 */
#define ADC2_A6_P2_20 A15X_MUX('2',20,0) /* PT2_20 */
#define TRIG_IN8_P2_20 A15X_MUX('2',20,1) /* PT2_20 */
#define LPSPI1_PCS2_P2_20 A15X_MUX('2',20,2) /* PT2_20 */
#define CT2_MAT0_P2_20 A15X_MUX('2',20,4) /* PT2_20 */
#define FLEXIO0_D28_P2_20 A15X_MUX('2',20,6) /* PT2_20 */
#define SmartDMA_PIO22_P2_20 A15X_MUX('2',20,7) /* PT2_20 */
#define ADC3_A6_P2_21 A15X_MUX('2',21,0) /* PT2_21 */
#define P2_21 A15X_MUX('2',21,0) /* PT2_21 */
#define OPAMP3_INN_P2_21 A15X_MUX('2',21,0) /* PT2_21 */
#define TRIG_IN9_P2_21 A15X_MUX('2',21,1) /* PT2_21 */
#define LPSPI1_PCS3_P2_21 A15X_MUX('2',21,2) /* PT2_21 */
#define CT2_MAT1_P2_21 A15X_MUX('2',21,4) /* PT2_21 */
#define FLEXIO0_D29_P2_21 A15X_MUX('2',21,6) /* PT2_21 */
#define SmartDMA_PIO23_P2_21 A15X_MUX('2',21,7) /* PT2_21 */
#define P2_22 A15X_MUX('2',22,0) /* PT2_22 */
#define CT2_MAT2_P2_22 A15X_MUX('2',22,4) /* PT2_22 */
#define FLEXIO0_D30_P2_22 A15X_MUX('2',22,6) /* PT2_22 */
#define P2_23 A15X_MUX('2',23,0) /* PT2_23 */
#define ADC3_A2_P2_23 A15X_MUX('2',23,0) /* PT2_23 */
#define OPAMP3_OUT_P2_23 A15X_MUX('2',23,0) /* PT2_23 */
#define TRIG_OUT5_P2_23 A15X_MUX('2',23,1) /* PT2_23 */
#define CT2_MAT3_P2_23 A15X_MUX('2',23,4) /* PT2_23 */
#define FLEXIO0_D31_P2_23 A15X_MUX('2',23,6) /* PT2_23 */
#define ADC2_A3_P2_24 A15X_MUX('2',24,0) /* PT2_24 */
#define P2_24 A15X_MUX('2',24,0) /* PT2_24 */
#define TRIG_OUT6_P2_24 A15X_MUX('2',24,1) /* PT2_24 */
#define CT_INP8_P2_24 A15X_MUX('2',24,4) /* PT2_24 */
#define ADC3_A3_P2_25 A15X_MUX('2',25,0) /* PT2_25 */
#define P2_25 A15X_MUX('2',25,0) /* PT2_25 */
#define TRIG_OUT7_P2_25 A15X_MUX('2',25,1) /* PT2_25 */
#define CT_INP9_P2_25 A15X_MUX('2',25,4) /* PT2_25 */
#define P2_26 A15X_MUX('2',26,0) /* PT2_26 */
#define TRIG_IN5_P2_26 A15X_MUX('2',26,1) /* PT2_26 */
#define CT_INP10_P2_26 A15X_MUX('2',26,4) /* PT2_26 */
#define TRIG_IN5/CT_INP10_P2_26_P2_26 A15X_MUX('2',26,4) /* PT2_26 */
#define WUU0_IN22_P3_0 A15X_MUX('3',0,0) /* PT3_0 */
#define P3_0 A15X_MUX('3',0,0) /* PT3_0 */
#define TRIG_IN0_P3_0 A15X_MUX('3',0,1) /* PT3_0 */
#define LPUART3_RXD_P3_0 A15X_MUX('3',0,3) /* PT3_0 */
#define CT_INP16_P3_0 A15X_MUX('3',0,4) /* PT3_0 */
#define TRIG_IN0/CT_INP16_P3_0_P3_0 A15X_MUX('3',0,4) /* PT3_0 */
#define PWM0_A0_P3_0 A15X_MUX('3',0,5) /* PT3_0 */
#define FLEXIO0_D8_P3_0 A15X_MUX('3',0,6) /* PT3_0 */
#define PWM1_X0_P3_0 A15X_MUX('3',0,7) /* PT3_0 */
#define LCD_P32_P3_0 A15X_MUX('3',0,9) /* PT3_0 */
#define SmartDMA_PIO0_P3_0 A15X_MUX('3',0,10) /* PT3_0 */
#define P3_1 A15X_MUX('3',1,0) /* PT3_1 */
#define TRIG_IN1_P3_1 A15X_MUX('3',1,1) /* PT3_1 */
#define LPUART3_TXD_P3_1 A15X_MUX('3',1,3) /* PT3_1 */
#define CT_INP17_P3_1 A15X_MUX('3',1,4) /* PT3_1 */
#define TRIG_IN1/CT_INP17_P3_1_P3_1 A15X_MUX('3',1,4) /* PT3_1 */
#define PWM0_B0_P3_1 A15X_MUX('3',1,5) /* PT3_1 */
#define FLEXIO0_D9_P3_1 A15X_MUX('3',1,6) /* PT3_1 */
#define PWM1_X1_P3_1 A15X_MUX('3',1,7) /* PT3_1 */
#define LCD_P33_P3_1 A15X_MUX('3',1,9) /* PT3_1 */
#define SmartDMA_PIO1_P3_1 A15X_MUX('3',1,10) /* PT3_1 */
#define FREQME_CLK_OUT0_P3_1 A15X_MUX('3',1,12) /* PT3_1 */
#define ADC3_A8_P3_2 A15X_MUX('3',2,0) /* PT3_2 */
#define P3_2 A15X_MUX('3',2,0) /* PT3_2 */
#define LPSPI1_PCS1_P3_2 A15X_MUX('3',2,2) /* PT3_2 */
#define CT4_MAT0_P3_2 A15X_MUX('3',2,4) /* PT3_2 */
#define PWM0_X0_P3_2 A15X_MUX('3',2,5) /* PT3_2 */
#define FLEXIO0_D10_P3_2 A15X_MUX('3',2,6) /* PT3_2 */
#define PWM1_X2_P3_2 A15X_MUX('3',2,7) /* PT3_2 */
#define SmartDMA_PIO2_P3_2 A15X_MUX('3',2,10) /* PT3_2 */
#define P3_3 A15X_MUX('3',3,0) /* PT3_3 */
#define ADC3_A9_P3_3 A15X_MUX('3',3,0) /* PT3_3 */
#define CT4_MAT1_P3_3 A15X_MUX('3',3,4) /* PT3_3 */
#define PWM0_X1_P3_3 A15X_MUX('3',3,5) /* PT3_3 */
#define FLEXIO0_D11_P3_3 A15X_MUX('3',3,6) /* PT3_3 */
#define PWM1_X3_P3_3 A15X_MUX('3',3,7) /* PT3_3 */
#define SmartDMA_PIO3_P3_3 A15X_MUX('3',3,10) /* PT3_3 */
#define ADC3_A10_P3_4 A15X_MUX('3',4,0) /* PT3_4 */
#define P3_4 A15X_MUX('3',4,0) /* PT3_4 */
#define CT_INP18_P3_4 A15X_MUX('3',4,4) /* PT3_4 */
#define PWM0_X2_P3_4 A15X_MUX('3',4,5) /* PT3_4 */
#define FLEXIO0_D12_P3_4 A15X_MUX('3',4,6) /* PT3_4 */
#define SmartDMA_PIO4_P3_4 A15X_MUX('3',4,10) /* PT3_4 */
#define P3_5 A15X_MUX('3',5,0) /* PT3_5 */
#define ADC3_A11_P3_5 A15X_MUX('3',5,0) /* PT3_5 */
#define CT_INP19_P3_5 A15X_MUX('3',5,4) /* PT3_5 */
#define PWM0_X3_P3_5 A15X_MUX('3',5,5) /* PT3_5 */
#define FLEXIO0_D13_P3_5 A15X_MUX('3',5,6) /* PT3_5 */
#define SmartDMA_PIO5_P3_5 A15X_MUX('3',5,10) /* PT3_5 */
#define P3_6 A15X_MUX('3',6,0) /* PT3_6 */
#define ADC3_A12_P3_6 A15X_MUX('3',6,0) /* PT3_6 */
#define CLKOUT_P3_6 A15X_MUX('3',6,1) /* PT3_6 */
#define LPSPI1_PCS3_P3_6 A15X_MUX('3',6,2) /* PT3_6 */
#define LPUART3_RTS_B_P3_6 A15X_MUX('3',6,3) /* PT3_6 */
#define CT4_MAT2_P3_6 A15X_MUX('3',6,4) /* PT3_6 */
#define PWM0_A3_P3_6 A15X_MUX('3',6,5) /* PT3_6 */
#define FLEXIO0_D14_P3_6 A15X_MUX('3',6,6) /* PT3_6 */
#define PWM1_A0_P3_6 A15X_MUX('3',6,7) /* PT3_6 */
#define LCD_P34_P3_6 A15X_MUX('3',6,9) /* PT3_6 */
#define SmartDMA_PIO6_P3_6 A15X_MUX('3',6,10) /* PT3_6 */
#define FREQME_CLK_OUT1_P3_6 A15X_MUX('3',6,12) /* PT3_6 */
#define P3_7 A15X_MUX('3',7,0) /* PT3_7 */
#define ADC3_A13_P3_7 A15X_MUX('3',7,0) /* PT3_7 */
#define TRIG_IN2_P3_7 A15X_MUX('3',7,1) /* PT3_7 */
#define LPSPI1_PCS2_P3_7 A15X_MUX('3',7,2) /* PT3_7 */
#define LPUART3_CTS_B_P3_7 A15X_MUX('3',7,3) /* PT3_7 */
#define CT4_MAT3_P3_7 A15X_MUX('3',7,4) /* PT3_7 */
#define PWM0_B3_P3_7 A15X_MUX('3',7,5) /* PT3_7 */
#define FLEXIO0_D15_P3_7 A15X_MUX('3',7,6) /* PT3_7 */
#define PWM1_B0_P3_7 A15X_MUX('3',7,7) /* PT3_7 */
#define LCD_P35_P3_7 A15X_MUX('3',7,9) /* PT3_7 */
#define SmartDMA_PIO7_P3_7 A15X_MUX('3',7,10) /* PT3_7 */
#define P3_8 A15X_MUX('3',8,0) /* PT3_8 */
#define WUU0_IN23_P3_8 A15X_MUX('3',8,0) /* PT3_8 */
#define TRIG_IN3_P3_8 A15X_MUX('3',8,1) /* PT3_8 */
#define LPSPI1_SDO_P3_8 A15X_MUX('3',8,2) /* PT3_8 */
#define LPUART1_RXD_P3_8 A15X_MUX('3',8,3) /* PT3_8 */
#define TRIG_IN3/CT_INP4_P3_8_P3_8 A15X_MUX('3',8,4) /* PT3_8 */
#define CT_INP4_P3_8 A15X_MUX('3',8,4) /* PT3_8 */
#define PWM0_A1_P3_8 A15X_MUX('3',8,5) /* PT3_8 */
#define FLEXIO0_D16_P3_8 A15X_MUX('3',8,6) /* PT3_8 */
#define LPUART5_CTS_B_P3_8 A15X_MUX('3',8,8) /* PT3_8 */
#define LCD_P36_P3_8 A15X_MUX('3',8,9) /* PT3_8 */
#define SmartDMA_PIO8_P3_8 A15X_MUX('3',8,10) /* PT3_8 */
#define CLKOUT_P3_8 A15X_MUX('3',8,12) /* PT3_8 */
#define P3_9 A15X_MUX('3',9,0) /* PT3_9 */
#define TRIG_IN4_P3_9 A15X_MUX('3',9,1) /* PT3_9 */
#define LPSPI1_SDI_P3_9 A15X_MUX('3',9,2) /* PT3_9 */
#define LPUART1_TXD_P3_9 A15X_MUX('3',9,3) /* PT3_9 */
#define CT_INP5_P3_9 A15X_MUX('3',9,4) /* PT3_9 */
#define TRIG_IN4/CT_INP5_P3_9_P3_9 A15X_MUX('3',9,4) /* PT3_9 */
#define PWM0_B1_P3_9 A15X_MUX('3',9,5) /* PT3_9 */
#define FLEXIO0_D17_P3_9 A15X_MUX('3',9,6) /* PT3_9 */
#define LPUART5_RTS_B_P3_9 A15X_MUX('3',9,8) /* PT3_9 */
#define LCD_P37_P3_9 A15X_MUX('3',9,9) /* PT3_9 */
#define SmartDMA_PIO9_P3_9 A15X_MUX('3',9,10) /* PT3_9 */
#define P3_10 A15X_MUX('3',10,0) /* PT3_10 */
#define TRIG_IN5_P3_10 A15X_MUX('3',10,1) /* PT3_10 */
#define LPSPI1_SCK_P3_10 A15X_MUX('3',10,2) /* PT3_10 */
#define LPUART1_RTS_B_P3_10 A15X_MUX('3',10,3) /* PT3_10 */
#define CT1_MAT0_P3_10 A15X_MUX('3',10,4) /* PT3_10 */
#define PWM0_A2_P3_10 A15X_MUX('3',10,5) /* PT3_10 */
#define FLEXIO0_D18_P3_10 A15X_MUX('3',10,6) /* PT3_10 */
#define LPUART5_TXD_P3_10 A15X_MUX('3',10,8) /* PT3_10 */
#define LCD_P38_P3_10 A15X_MUX('3',10,9) /* PT3_10 */
#define SmartDMA_PIO10_P3_10 A15X_MUX('3',10,10) /* PT3_10 */
#define P3_11 A15X_MUX('3',11,0) /* PT3_11 */
#define WUU0_IN24_P3_11 A15X_MUX('3',11,0) /* PT3_11 */
#define TRIG_IN6_P3_11 A15X_MUX('3',11,1) /* PT3_11 */
#define LPSPI1_PCS0_P3_11 A15X_MUX('3',11,2) /* PT3_11 */
#define LPUART1_CTS_B_P3_11 A15X_MUX('3',11,3) /* PT3_11 */
#define CT1_MAT1_P3_11 A15X_MUX('3',11,4) /* PT3_11 */
#define PWM0_B2_P3_11 A15X_MUX('3',11,5) /* PT3_11 */
#define FLEXIO0_D19_P3_11 A15X_MUX('3',11,6) /* PT3_11 */
#define LPUART5_RXD_P3_11 A15X_MUX('3',11,8) /* PT3_11 */
#define LCD_P39_P3_11 A15X_MUX('3',11,9) /* PT3_11 */
#define SmartDMA_PIO11_P3_11 A15X_MUX('3',11,10) /* PT3_11 */
#define P3_12 A15X_MUX('3',12,0) /* PT3_12 */
#define ADC3_A14_P3_12 A15X_MUX('3',12,0) /* PT3_12 */
#define LPUART2_RTS_B_P3_12 A15X_MUX('3',12,2) /* PT3_12 */
#define LPUART3_TXD_P3_12 A15X_MUX('3',12,3) /* PT3_12 */
#define CT1_MAT2_P3_12 A15X_MUX('3',12,4) /* PT3_12 */
#define PWM0_X0_P3_12 A15X_MUX('3',12,5) /* PT3_12 */
#define FLEXIO0_D20_P3_12 A15X_MUX('3',12,6) /* PT3_12 */
#define PWM1_A2_P3_12 A15X_MUX('3',12,7) /* PT3_12 */
#define LCD_P40_P3_12 A15X_MUX('3',12,9) /* PT3_12 */
#define SmartDMA_PIO12_P3_12 A15X_MUX('3',12,10) /* PT3_12 */
#define P3_13 A15X_MUX('3',13,0) /* PT3_13 */
#define ADC3_A15_P3_13 A15X_MUX('3',13,0) /* PT3_13 */
#define LPUART2_CTS_B_P3_13 A15X_MUX('3',13,2) /* PT3_13 */
#define LPUART3_RXD_P3_13 A15X_MUX('3',13,3) /* PT3_13 */
#define CT1_MAT3_P3_13 A15X_MUX('3',13,4) /* PT3_13 */
#define PWM0_X1_P3_13 A15X_MUX('3',13,5) /* PT3_13 */
#define FLEXIO0_D21_P3_13 A15X_MUX('3',13,6) /* PT3_13 */
#define PWM1_B2_P3_13 A15X_MUX('3',13,7) /* PT3_13 */
#define LCD_P41_P3_13 A15X_MUX('3',13,9) /* PT3_13 */
#define SmartDMA_PIO13_P3_13 A15X_MUX('3',13,10) /* PT3_13 */
#define ADC3_A16_P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define WUU0_IN25_P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define P3_14 A15X_MUX('3',14,0) /* PT3_14 */
#define LPUART2_RXD_P3_14 A15X_MUX('3',14,2) /* PT3_14 */
#define LPUART3_CTS_B_P3_14 A15X_MUX('3',14,3) /* PT3_14 */
#define CT_INP6_P3_14 A15X_MUX('3',14,4) /* PT3_14 */
#define PWM0_X2_P3_14 A15X_MUX('3',14,5) /* PT3_14 */
#define FLEXIO0_D22_P3_14 A15X_MUX('3',14,6) /* PT3_14 */
#define PWM1_A1_P3_14 A15X_MUX('3',14,7) /* PT3_14 */
#define LCD_P42_P3_14 A15X_MUX('3',14,9) /* PT3_14 */
#define SmartDMA_PIO14_P3_14 A15X_MUX('3',14,10) /* PT3_14 */
#define P3_15 A15X_MUX('3',15,0) /* PT3_15 */
#define ADC3_A17_P3_15 A15X_MUX('3',15,0) /* PT3_15 */
#define LPUART2_TXD_P3_15 A15X_MUX('3',15,2) /* PT3_15 */
#define LPUART3_RTS_B_P3_15 A15X_MUX('3',15,3) /* PT3_15 */
#define CT_INP7_P3_15 A15X_MUX('3',15,4) /* PT3_15 */
#define PWM0_X3_P3_15 A15X_MUX('3',15,5) /* PT3_15 */
#define FLEXIO0_D23_P3_15 A15X_MUX('3',15,6) /* PT3_15 */
#define PWM1_B1_P3_15 A15X_MUX('3',15,7) /* PT3_15 */
#define LCD_P43_P3_15 A15X_MUX('3',15,9) /* PT3_15 */
#define SmartDMA_PIO15_P3_15 A15X_MUX('3',15,10) /* PT3_15 */
#define P3_16 A15X_MUX('3',16,0) /* PT3_16 */
#define LPUART4_RTS_B_P3_16 A15X_MUX('3',16,2) /* PT3_16 */
#define CT_INP8_P3_16 A15X_MUX('3',16,4) /* PT3_16 */
#define FLEXIO0_D24_P3_16 A15X_MUX('3',16,6) /* PT3_16 */
#define PWM1_A0_P3_16 A15X_MUX('3',16,7) /* PT3_16 */
#define LCD_P44_P3_16 A15X_MUX('3',16,9) /* PT3_16 */
#define SmartDMA_PIO16_P3_16 A15X_MUX('3',16,10) /* PT3_16 */
#define P3_17 A15X_MUX('3',17,0) /* PT3_17 */
#define LPUART4_CTS_B_P3_17 A15X_MUX('3',17,2) /* PT3_17 */
#define CT_INP9_P3_17 A15X_MUX('3',17,4) /* PT3_17 */
#define FLEXIO0_D25_P3_17 A15X_MUX('3',17,6) /* PT3_17 */
#define PWM1_B0_P3_17 A15X_MUX('3',17,7) /* PT3_17 */
#define LCD_P45_P3_17 A15X_MUX('3',17,9) /* PT3_17 */
#define SmartDMA_PIO17_P3_17 A15X_MUX('3',17,10) /* PT3_17 */
#define P3_18 A15X_MUX('3',18,0) /* PT3_18 */
#define LPUART4_RXD_P3_18 A15X_MUX('3',18,2) /* PT3_18 */
#define CT2_MAT0_P3_18 A15X_MUX('3',18,4) /* PT3_18 */
#define PWM0_X0_P3_18 A15X_MUX('3',18,5) /* PT3_18 */
#define FLEXIO0_D26_P3_18 A15X_MUX('3',18,6) /* PT3_18 */
#define PWM1_X0_P3_18 A15X_MUX('3',18,7) /* PT3_18 */
#define LCD_P46_P3_18 A15X_MUX('3',18,9) /* PT3_18 */
#define SmartDMA_PIO18_P3_18 A15X_MUX('3',18,10) /* PT3_18 */
#define P3_19 A15X_MUX('3',19,0) /* PT3_19 */
#define LPUART4_TXD_P3_19 A15X_MUX('3',19,2) /* PT3_19 */
#define CT2_MAT1_P3_19 A15X_MUX('3',19,4) /* PT3_19 */
#define PWM0_X1_P3_19 A15X_MUX('3',19,5) /* PT3_19 */
#define FLEXIO0_D27_P3_19 A15X_MUX('3',19,6) /* PT3_19 */
#define PWM1_X1_P3_19 A15X_MUX('3',19,7) /* PT3_19 */
#define LCD_P47_P3_19 A15X_MUX('3',19,9) /* PT3_19 */
#define SmartDMA_PIO19_P3_19 A15X_MUX('3',19,10) /* PT3_19 */
#define ADC3_A18_P3_20 A15X_MUX('3',20,0) /* PT3_20 */
#define P3_20 A15X_MUX('3',20,0) /* PT3_20 */
#define TRIG_OUT0_P3_20 A15X_MUX('3',20,1) /* PT3_20 */
#define LPI2C3_SDA_P3_20 A15X_MUX('3',20,2) /* PT3_20 */
#define LPUART1_RXD_P3_20 A15X_MUX('3',20,3) /* PT3_20 */
#define CT2_MAT2_P3_20 A15X_MUX('3',20,4) /* PT3_20 */
#define PWM0_X2_P3_20 A15X_MUX('3',20,5) /* PT3_20 */
#define FLEXIO0_D28_P3_20 A15X_MUX('3',20,6) /* PT3_20 */
#define PWM1_A3_P3_20 A15X_MUX('3',20,7) /* PT3_20 */
#define SmartDMA_PIO20_P3_20 A15X_MUX('3',20,10) /* PT3_20 */
#define P3_21 A15X_MUX('3',21,0) /* PT3_21 */
#define ADC3_A19_P3_21 A15X_MUX('3',21,0) /* PT3_21 */
#define TRIG_OUT1_P3_21 A15X_MUX('3',21,1) /* PT3_21 */
#define LPI2C3_SCL_P3_21 A15X_MUX('3',21,2) /* PT3_21 */
#define LPUART1_TXD_P3_21 A15X_MUX('3',21,3) /* PT3_21 */
#define CT2_MAT3_P3_21 A15X_MUX('3',21,4) /* PT3_21 */
#define PWM0_X3_P3_21 A15X_MUX('3',21,5) /* PT3_21 */
#define FLEXIO0_D29_P3_21 A15X_MUX('3',21,6) /* PT3_21 */
#define PWM1_B3_P3_21 A15X_MUX('3',21,7) /* PT3_21 */
#define SmartDMA_PIO21_P3_21 A15X_MUX('3',21,10) /* PT3_21 */
#define ADC3_A20_P3_22 A15X_MUX('3',22,0) /* PT3_22 */
#define P3_22 A15X_MUX('3',22,0) /* PT3_22 */
#define LPUART1_RTS_B_P3_22 A15X_MUX('3',22,3) /* PT3_22 */
#define CT_INP10_P3_22 A15X_MUX('3',22,4) /* PT3_22 */
#define FLEXIO0_D30_P3_22 A15X_MUX('3',22,6) /* PT3_22 */
#define PWM1_X2_P3_22 A15X_MUX('3',22,7) /* PT3_22 */
#define SmartDMA_PIO22_P3_22 A15X_MUX('3',22,10) /* PT3_22 */
#define P3_23 A15X_MUX('3',23,0) /* PT3_23 */
#define ADC3_A21_P3_23 A15X_MUX('3',23,0) /* PT3_23 */
#define LPUART1_CTS_B_P3_23 A15X_MUX('3',23,3) /* PT3_23 */
#define CT_INP11_P3_23 A15X_MUX('3',23,4) /* PT3_23 */
#define FLEXIO0_D31_P3_23 A15X_MUX('3',23,6) /* PT3_23 */
#define PWM1_X3_P3_23 A15X_MUX('3',23,7) /* PT3_23 */
#define SmartDMA_PIO23_P3_23 A15X_MUX('3',23,10) /* PT3_23 */
#define P3_24 A15X_MUX('3',24,0) /* PT3_24 */
#define ADC3_A22_P3_24 A15X_MUX('3',24,0) /* PT3_24 */
#define TRIG_IN11_P3_24 A15X_MUX('3',24,1) /* PT3_24 */
#define CT_INP16_P3_24 A15X_MUX('3',24,4) /* PT3_24 */
#define TRIG_IN11/CT_INP16_P3_24_P3_24 A15X_MUX('3',24,4) /* PT3_24 */
#define FLEXIO0_D24_P3_24 A15X_MUX('3',24,6) /* PT3_24 */
#define SmartDMA_PIO24_P3_24 A15X_MUX('3',24,10) /* PT3_24 */
#define ADC3_A23_P3_25 A15X_MUX('3',25,0) /* PT3_25 */
#define P3_25 A15X_MUX('3',25,0) /* PT3_25 */
#define TRIG_OUT6_P3_25 A15X_MUX('3',25,1) /* PT3_25 */
#define CT_INP15_P3_25 A15X_MUX('3',25,4) /* PT3_25 */
#define FLEXIO0_D25_P3_25 A15X_MUX('3',25,6) /* PT3_25 */
#define SmartDMA_PIO25_P3_25 A15X_MUX('3',25,10) /* PT3_25 */
#define P3_26 A15X_MUX('3',26,0) /* PT3_26 */
#define TRIG_IN10_P3_26 A15X_MUX('3',26,1) /* PT3_26 */
#define CT_INP14_P3_26 A15X_MUX('3',26,4) /* PT3_26 */
#define TRIG_IN10/CT_INP14_P3_26_P3_26 A15X_MUX('3',26,4) /* PT3_26 */
#define FLEXIO0_D26_P3_26 A15X_MUX('3',26,6) /* PT3_26 */
#define SmartDMA_PIO26_P3_26 A15X_MUX('3',26,10) /* PT3_26 */
#define WUU0_IN30_P3_27 A15X_MUX('3',27,0) /* PT3_27 */
#define P3_27 A15X_MUX('3',27,0) /* PT3_27 */
#define TRIG_OUT7_P3_27 A15X_MUX('3',27,1) /* PT3_27 */
#define LPI2C3_SCL_P3_27 A15X_MUX('3',27,2) /* PT3_27 */
#define LPUART4_TXD_P3_27 A15X_MUX('3',27,3) /* PT3_27 */
#define CT_INP13_P3_27 A15X_MUX('3',27,4) /* PT3_27 */
#define CT3_MAT1_P3_27 A15X_MUX('3',27,5) /* PT3_27 */
#define FLEXIO0_D27_P3_27 A15X_MUX('3',27,6) /* PT3_27 */
#define PWM1_A3_P3_27 A15X_MUX('3',27,7) /* PT3_27 */
#define SmartDMA_PIO27_P3_27 A15X_MUX('3',27,10) /* PT3_27 */
#define WUU0_IN26_P3_28 A15X_MUX('3',28,0) /* PT3_28 */
#define P3_28 A15X_MUX('3',28,0) /* PT3_28 */
